f32c/arduino/hardware/f32c/mips/boards.txt
#
# FER ULX2S board, f32c/mips SoC, logical pin mapping
#
ulx2s_mips.name=FER ULX2S f32c/mips (Lattice XP2) logical pin mapping
ulx2s_mips.vid.0=0x0403
ulx2s_mips.pid.0=0x6001
ulx2s_mips.build.mcu=f32c
ulx2s_mips.build.core=f32c
ulx2s_mips.build.usb_product="ULX2S board UART / JTAG"
ulx2s_mips.build.board=ulx2s-f32c-mips
ulx2s_mips.build.extra_flags=-mno-div {build.usb_flags}
ulx2s_mips.build.ldscript=linker_scripts/gcc/flash.ld
ulx2s_mips.build.variant=ulx2s_logical
ulx2s_mips.build.vid=0x0403
ulx2s_mips.build.pid=0x6001

ulx2s_mips.bootloader.file=f32c_mips/f32c_mips_timer_boot_2380.jed

ulx2s_mips.upload.tool=ujprog
ulx2s_mips.upload.protocol=ujprog
ulx2s_mips.upload.maximum_size=1015808
ulx2s_mips.upload.use_1200bps_touch=true
ulx2s_mips.upload.wait_for_upload_port=false
ulx2s_mips.upload.native_usb=false

#
# FER ULX2S board, f32c/mips SoC, pyhsical pin mapping
#
ulx2s_mips_phys.name=FER ULX2S f32c/mips (Lattice XP2) physical pin mapping
ulx2s_mips_phys.vid.0=0x0403
ulx2s_mips_phys.pid.0=0x6001
ulx2s_mips_phys.build.mcu=f32c
ulx2s_mips_phys.build.core=f32c
ulx2s_mips_phys.build.usb_product="ULX2S board UART / JTAG"
ulx2s_mips_phys.build.board=ulx2s-f32c-mips
ulx2s_mips_phys.build.extra_flags=-mno-div {build.usb_flags}
ulx2s_mips_phys.build.ldscript=linker_scripts/gcc/flash.ld
ulx2s_mips_phys.build.variant=ulx2s_physical
ulx2s_mips_phys.build.vid=0x0403
ulx2s_mips_phys.build.pid=0x6001

ulx2s_mips_phys.bootloader.file=f32c_mips/f32c_mips_timer_boot_2380.jed

ulx2s_mips_phys.upload.tool=ujprog
ulx2s_mips_phys.upload.protocol=ujprog
ulx2s_mips_phys.upload.maximum_size=1015808
ulx2s_mips_phys.upload.use_1200bps_touch=true
ulx2s_mips_phys.upload.wait_for_upload_port=false
ulx2s_mips_phys.upload.native_usb=false
